
#  ____                     __ _ _
# | __ ) _ __ _____      __/ _(_) | ___
# |  _ \| '__/ _ \ \ /\ / / |_| | |/ _ \
# | |_) | | |  __/\ V  V /|  _| | |  __/
# |____/|_|  \___| \_/\_/ |_| |_|_|\___|
#

cask_args appdir: "/Applications"

# shell
brew 'git'
brew 'bash'
brew 'zsh'
brew 'zsh-completions'
brew 'fd'
brew 'tree'
brew 'ncdu'
brew 'tldr'
brew 'htop'
brew 'jq'
brew 'bat'
brew 'hyperfine'
brew 'git-delta'
brew 'gh'
brew '1password-cli'

# package manager
brew 'mas'

# network
brew 'wget'
brew 'curl'
brew 'rsync'
brew 'mosh'

# convert
brew 'ffmpeg'
brew 'pandoc'

# env
brew 'direnv'

# cask
tap 'homebrew/cask'
cask 'iterm2'
cask 'karabiner-elements'
cask 'amethyst'
cask 'monitorcontrol'
cask 'alfred'
cask '1password'
cask 'google-chrome'
cask 'visual-studio-code'
cask 'jetbrains-toolbox'
# cask 'zoom'
cask 'docker'
cask 'postman'

# font
tap 'homebrew/cask-fonts'
cask 'font-hackgen-nerd'

mas 'RunCat', id: 1429033973
mas 'LINE', id: 539883307
mas 'Slack', id: 803453959
